node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "filenames"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 105
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 105
          }
        }
        string_val: "data/outputData.csv-00000-of-00001"
        string_val: "data/outputData.csv-00000-of-00104"
        string_val: "data/outputData.csv-00001-of-00104"
        string_val: "data/outputData.csv-00002-of-00104"
        string_val: "data/outputData.csv-00003-of-00104"
        string_val: "data/outputData.csv-00004-of-00104"
        string_val: "data/outputData.csv-00005-of-00104"
        string_val: "data/outputData.csv-00006-of-00104"
        string_val: "data/outputData.csv-00007-of-00104"
        string_val: "data/outputData.csv-00008-of-00104"
        string_val: "data/outputData.csv-00009-of-00104"
        string_val: "data/outputData.csv-00010-of-00104"
        string_val: "data/outputData.csv-00011-of-00104"
        string_val: "data/outputData.csv-00012-of-00104"
        string_val: "data/outputData.csv-00013-of-00104"
        string_val: "data/outputData.csv-00014-of-00104"
        string_val: "data/outputData.csv-00015-of-00104"
        string_val: "data/outputData.csv-00016-of-00104"
        string_val: "data/outputData.csv-00017-of-00104"
        string_val: "data/outputData.csv-00018-of-00104"
        string_val: "data/outputData.csv-00019-of-00104"
        string_val: "data/outputData.csv-00020-of-00104"
        string_val: "data/outputData.csv-00021-of-00104"
        string_val: "data/outputData.csv-00022-of-00104"
        string_val: "data/outputData.csv-00023-of-00104"
        string_val: "data/outputData.csv-00024-of-00104"
        string_val: "data/outputData.csv-00025-of-00104"
        string_val: "data/outputData.csv-00026-of-00104"
        string_val: "data/outputData.csv-00027-of-00104"
        string_val: "data/outputData.csv-00028-of-00104"
        string_val: "data/outputData.csv-00029-of-00104"
        string_val: "data/outputData.csv-00030-of-00104"
        string_val: "data/outputData.csv-00031-of-00104"
        string_val: "data/outputData.csv-00032-of-00104"
        string_val: "data/outputData.csv-00033-of-00104"
        string_val: "data/outputData.csv-00034-of-00104"
        string_val: "data/outputData.csv-00035-of-00104"
        string_val: "data/outputData.csv-00036-of-00104"
        string_val: "data/outputData.csv-00037-of-00104"
        string_val: "data/outputData.csv-00038-of-00104"
        string_val: "data/outputData.csv-00039-of-00104"
        string_val: "data/outputData.csv-00040-of-00104"
        string_val: "data/outputData.csv-00041-of-00104"
        string_val: "data/outputData.csv-00042-of-00104"
        string_val: "data/outputData.csv-00043-of-00104"
        string_val: "data/outputData.csv-00044-of-00104"
        string_val: "data/outputData.csv-00045-of-00104"
        string_val: "data/outputData.csv-00046-of-00104"
        string_val: "data/outputData.csv-00047-of-00104"
        string_val: "data/outputData.csv-00048-of-00104"
        string_val: "data/outputData.csv-00049-of-00104"
        string_val: "data/outputData.csv-00050-of-00104"
        string_val: "data/outputData.csv-00051-of-00104"
        string_val: "data/outputData.csv-00052-of-00104"
        string_val: "data/outputData.csv-00053-of-00104"
        string_val: "data/outputData.csv-00054-of-00104"
        string_val: "data/outputData.csv-00055-of-00104"
        string_val: "data/outputData.csv-00056-of-00104"
        string_val: "data/outputData.csv-00057-of-00104"
        string_val: "data/outputData.csv-00058-of-00104"
        string_val: "data/outputData.csv-00059-of-00104"
        string_val: "data/outputData.csv-00060-of-00104"
        string_val: "data/outputData.csv-00061-of-00104"
        string_val: "data/outputData.csv-00062-of-00104"
        string_val: "data/outputData.csv-00063-of-00104"
        string_val: "data/outputData.csv-00064-of-00104"
        string_val: "data/outputData.csv-00065-of-00104"
        string_val: "data/outputData.csv-00066-of-00104"
        string_val: "data/outputData.csv-00067-of-00104"
        string_val: "data/outputData.csv-00068-of-00104"
        string_val: "data/outputData.csv-00069-of-00104"
        string_val: "data/outputData.csv-00070-of-00104"
        string_val: "data/outputData.csv-00071-of-00104"
        string_val: "data/outputData.csv-00072-of-00104"
        string_val: "data/outputData.csv-00073-of-00104"
        string_val: "data/outputData.csv-00074-of-00104"
        string_val: "data/outputData.csv-00075-of-00104"
        string_val: "data/outputData.csv-00076-of-00104"
        string_val: "data/outputData.csv-00077-of-00104"
        string_val: "data/outputData.csv-00078-of-00104"
        string_val: "data/outputData.csv-00079-of-00104"
        string_val: "data/outputData.csv-00080-of-00104"
        string_val: "data/outputData.csv-00081-of-00104"
        string_val: "data/outputData.csv-00082-of-00104"
        string_val: "data/outputData.csv-00083-of-00104"
        string_val: "data/outputData.csv-00084-of-00104"
        string_val: "data/outputData.csv-00085-of-00104"
        string_val: "data/outputData.csv-00086-of-00104"
        string_val: "data/outputData.csv-00087-of-00104"
        string_val: "data/outputData.csv-00088-of-00104"
        string_val: "data/outputData.csv-00089-of-00104"
        string_val: "data/outputData.csv-00090-of-00104"
        string_val: "data/outputData.csv-00091-of-00104"
        string_val: "data/outputData.csv-00092-of-00104"
        string_val: "data/outputData.csv-00093-of-00104"
        string_val: "data/outputData.csv-00094-of-00104"
        string_val: "data/outputData.csv-00095-of-00104"
        string_val: "data/outputData.csv-00096-of-00104"
        string_val: "data/outputData.csv-00097-of-00104"
        string_val: "data/outputData.csv-00098-of-00104"
        string_val: "data/outputData.csv-00099-of-00104"
        string_val: "data/outputData.csv-00100-of-00104"
        string_val: "data/outputData.csv-00101-of-00104"
        string_val: "data/outputData.csv-00102-of-00104"
        string_val: "data/outputData.csv-00103-of-00104"
      }
    }
  }
}
node {
  name: "compression_type"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "buffer_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 262144
      }
    }
  }
}
node {
  name: "buffer_size_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 256
      }
    }
  }
}
node {
  name: "seed"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "seed2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "count"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1
      }
    }
  }
}
node {
  name: "batch_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 32
      }
    }
  }
}
node {
  name: "OneShotIterator"
  op: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dataset_factory"
    value {
      func {
        name: "_make_dataset_2c378c10"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_STRING
        type: DT_INT32
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_STRING
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "IteratorToStringHandle"
  op: "IteratorToStringHandle"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "IteratorGetNext"
  op: "IteratorGetNext"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_STRING
        type: DT_INT32
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_STRING
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Altitude/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Altitude/ExpandDims"
  op: "ExpandDims"
  input: "IteratorGetNext"
  input: "dnn/input_from_feature_columns/input_layer/Altitude/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Altitude/Shape"
  op: "Shape"
  input: "dnn/input_from_feature_columns/input_layer/Altitude/ExpandDims"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Altitude/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Altitude/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Altitude/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Altitude/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/Altitude/Shape"
  input: "dnn/input_from_feature_columns/input_layer/Altitude/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/Altitude/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/Altitude/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Altitude/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Altitude/Reshape/shape"
  op: "Pack"
  input: "dnn/input_from_feature_columns/input_layer/Altitude/strided_slice"
  input: "dnn/input_from_feature_columns/input_layer/Altitude/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Altitude/Reshape"
  op: "Reshape"
  input: "dnn/input_from_feature_columns/input_layer/Altitude/ExpandDims"
  input: "dnn/input_from_feature_columns/input_layer/Altitude/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/DateP/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/DateP/ExpandDims"
  op: "ExpandDims"
  input: "IteratorGetNext:1"
  input: "dnn/input_from_feature_columns/input_layer/DateP/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/DateP/Shape"
  op: "Shape"
  input: "dnn/input_from_feature_columns/input_layer/DateP/ExpandDims"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/DateP/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/DateP/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/DateP/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/DateP/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/DateP/Shape"
  input: "dnn/input_from_feature_columns/input_layer/DateP/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/DateP/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/DateP/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/DateP/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/DateP/Reshape/shape"
  op: "Pack"
  input: "dnn/input_from_feature_columns/input_layer/DateP/strided_slice"
  input: "dnn/input_from_feature_columns/input_layer/DateP/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/DateP/Reshape"
  op: "Reshape"
  input: "dnn/input_from_feature_columns/input_layer/DateP/ExpandDims"
  input: "dnn/input_from_feature_columns/input_layer/DateP/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat/ExpandDims"
  op: "ExpandDims"
  input: "IteratorGetNext:4"
  input: "dnn/input_from_feature_columns/input_layer/Lat/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat/Shape"
  op: "Shape"
  input: "dnn/input_from_feature_columns/input_layer/Lat/ExpandDims"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/Lat/Shape"
  input: "dnn/input_from_feature_columns/input_layer/Lat/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/Lat/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/Lat/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat/Reshape/shape"
  op: "Pack"
  input: "dnn/input_from_feature_columns/input_layer/Lat/strided_slice"
  input: "dnn/input_from_feature_columns/input_layer/Lat/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat/Reshape"
  op: "Reshape"
  input: "dnn/input_from_feature_columns/input_layer/Lat/ExpandDims"
  input: "dnn/input_from_feature_columns/input_layer/Lat/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat_bucketized_X_Long_bucketized_embedding/Bucketize"
  op: "Bucketize"
  input: "dnn/input_from_feature_columns/input_layer/Lat/ExpandDims"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "boundaries"
    value {
      list {
        f: -180.0
        f: -178.99721448467966
        f: -177.99442896935932
        f: -176.991643454039
        f: -175.98885793871867
        f: -174.98607242339833
        f: -173.983286908078
        f: -172.98050139275767
        f: -171.97771587743733
        f: -170.974930362117
        f: -169.97214484679665
        f: -168.9693593314763
        f: -167.966573816156
        f: -166.96378830083566
        f: -165.96100278551532
        f: -164.95821727019498
        f: -163.95543175487467
        f: -162.95264623955433
        f: -161.949860724234
        f: -160.94707520891365
        f: -159.9442896935933
        f: -158.941504178273
        f: -157.93871866295265
        f: -156.9359331476323
        f: -155.93314763231197
        f: -154.93036211699166
        f: -153.92757660167132
        f: -152.92479108635098
        f: -151.92200557103064
        f: -150.9192200557103
        f: -149.91643454038996
        f: -148.91364902506965
        f: -147.9108635097493
        f: -146.90807799442896
        f: -145.90529247910865
        f: -144.9025069637883
        f: -143.89972144846797
        f: -142.89693593314763
        f: -141.8941504178273
        f: -140.89136490250695
        f: -139.88857938718664
        f: -138.8857938718663
        f: -137.88300835654596
        f: -136.88022284122565
        f: -135.8774373259053
        f: -134.87465181058496
        f: -133.87186629526462
        f: -132.86908077994428
        f: -131.86629526462394
        f: -130.86350974930363
        f: -129.8607242339833
        f: -128.85793871866295
        f: -127.85515320334262
        f: -126.85236768802228
        f: -125.84958217270196
        f: -124.84679665738162
        f: -123.84401114206128
        f: -122.84122562674095
        f: -121.83844011142062
        f: -120.83565459610028
        f: -119.83286908077994
        f: -118.8300835654596
        f: -117.82729805013928
        f: -116.82451253481895
        f: -115.82172701949861
        f: -114.81894150417827
        f: -113.81615598885794
        f: -112.8133704735376
        f: -111.81058495821728
        f: -110.80779944289694
        f: -109.80501392757661
        f: -108.80222841225627
        f: -107.79944289693594
        f: -106.7966573816156
        f: -105.79387186629526
        f: -104.79108635097494
        f: -103.7883008356546
        f: -102.78551532033427
        f: -101.78272980501393
        f: -100.7799442896936
        f: -99.77715877437326
        f: -98.77437325905292
        f: -97.7715877437326
        f: -96.76880222841226
        f: -95.76601671309193
        f: -94.76323119777159
        f: -93.76044568245126
        f: -92.75766016713092
        f: -91.75487465181058
        f: -90.75208913649026
        f: -89.74930362116991
        f: -88.74651810584959
        f: -87.74373259052925
        f: -86.74094707520892
        f: -85.73816155988858
        f: -84.73537604456826
        f: -83.73259052924791
        f: -82.72980501392757
        f: -81.72701949860725
        f: -80.72423398328691
        f: -79.72144846796658
        f: -78.71866295264624
        f: -77.71587743732591
        f: -76.71309192200557
        f: -75.71030640668525
        f: -74.70752089136491
        f: -73.70473537604457
        f: -72.70194986072424
        f: -71.6991643454039
        f: -70.69637883008357
        f: -69.69359331476323
        f: -68.69080779944291
        f: -67.68802228412257
        f: -66.68523676880223
        f: -65.6824512534819
        f: -64.67966573816156
        f: -63.676880222841234
        f: -62.674094707520894
        f: -61.67130919220057
        f: -60.66852367688023
        f: -59.66573816155989
        f: -58.66295264623956
        f: -57.66016713091922
        f: -56.657381615598894
        f: -55.65459610027855
        f: -54.65181058495823
        f: -53.64902506963789
        f: -52.64623955431756
        f: -51.64345403899722
        f: -50.64066852367688
        f: -49.63788300835654
        f: -48.63509749303623
        f: -47.63231197771589
        f: -46.629526462395546
        f: -45.626740947075206
        f: -44.623955431754894
        f: -43.62116991643455
        f: -42.61838440111421
        f: -41.61559888579387
        f: -40.61281337047353
        f: -39.61002785515322
        f: -38.60724233983288
        f: -37.60445682451254
        f: -36.6016713091922
        f: -35.59888579387189
        f: -34.596100278551546
        f: -33.593314763231206
        f: -32.590529247910865
        f: -31.587743732590525
        f: -30.584958217270213
        f: -29.582172701949872
        f: -28.579387186629532
        f: -27.57660167130919
        f: -26.57381615598885
        f: -25.57103064066854
        f: -24.5682451253482
        f: -23.565459610027858
        f: -22.562674094707518
        f: -21.559888579387206
        f: -20.557103064066865
        f: -19.554317548746525
        f: -18.551532033426184
        f: -17.548746518105844
        f: -16.545961002785532
        f: -15.543175487465192
        f: -14.540389972144851
        f: -13.53760445682451
        f: -12.534818941504199
        f: -11.532033426183858
        f: -10.529247910863518
        f: -9.526462395543177
        f: -8.523676880222837
        f: -7.520891364902525
        f: -6.518105849582184
        f: -5.515320334261844
        f: -4.5125348189415035
        f: -3.509749303621163
        f: -2.506963788300851
        f: -1.5041782729805107
        f: -0.5013927576601702
        f: 0.5013927576601702
        f: 1.5041782729804822
        f: 2.5069637883008227
        f: 3.509749303621163
        f: 4.5125348189415035
        f: 5.515320334261844
        f: 6.518105849582156
        f: 7.520891364902496
        f: 8.523676880222837
        f: 9.526462395543177
        f: 10.52924791086349
        f: 11.53203342618383
        f: 12.53481894150417
        f: 13.53760445682451
        f: 14.540389972144851
        f: 15.543175487465163
        f: 16.545961002785504
        f: 17.548746518105844
        f: 18.551532033426184
        f: 19.554317548746496
        f: 20.557103064066837
        f: 21.559888579387177
        f: 22.562674094707518
        f: 23.565459610027858
        f: 24.56824512534817
        f: 25.57103064066851
        f: 26.57381615598885
        f: 27.57660167130919
        f: 28.579387186629504
        f: 29.582172701949844
        f: 30.584958217270184
        f: 31.587743732590525
        f: 32.590529247910865
        f: 33.59331476323118
        f: 34.59610027855152
        f: 35.59888579387186
        f: 36.6016713091922
        f: 37.60445682451254
        f: 38.60724233983285
        f: 39.61002785515319
        f: 40.61281337047353
        f: 41.61559888579387
        f: 42.618384401114184
        f: 43.621169916434525
        f: 44.623955431754865
        f: 45.626740947075206
        f: 46.629526462395546
        f: 47.63231197771586
        f: 48.6350974930362
        f: 49.63788300835654
        f: 50.64066852367688
        f: 51.64345403899719
        f: 52.64623955431753
        f: 53.64902506963787
        f: 54.65181058495821
        f: 55.65459610027855
        f: 56.657381615598865
        f: 57.660167130919206
        f: 58.662952646239546
        f: 59.66573816155989
        f: 60.66852367688023
        f: 61.67130919220054
        f: 62.67409470752088
        f: 63.67688022284122
        f: 64.67966573816156
        f: 65.68245125348187
        f: 66.68523676880221
        f: 67.68802228412255
        f: 68.6908077994429
        f: 69.69359331476323
        f: 70.69637883008355
        f: 71.69916434540389
        f: 72.70194986072423
        f: 73.70473537604457
        f: 74.70752089136488
        f: 75.71030640668522
        f: 76.71309192200556
        f: 77.7158774373259
        f: 78.71866295264624
        f: 79.72144846796658
        f: 80.72423398328692
        f: 81.7270194986072
        f: 82.72980501392755
        f: 83.73259052924789
        f: 84.73537604456823
        f: 85.73816155988857
        f: 86.74094707520891
        f: 87.74373259052925
        f: 88.74651810584959
        f: 89.74930362116993
        f: 90.75208913649021
        f: 91.75487465181055
        f: 92.7576601671309
        f: 93.76044568245123
        f: 94.76323119777157
        f: 95.76601671309191
        f: 96.76880222841226
        f: 97.7715877437326
        f: 98.77437325905294
        f: 99.77715877437322
        f: 100.77994428969356
        f: 101.7827298050139
        f: 102.78551532033424
        f: 103.78830083565458
        f: 104.79108635097492
        f: 105.79387186629526
        f: 106.7966573816156
        f: 107.79944289693594
        f: 108.80222841225623
        f: 109.80501392757657
        f: 110.80779944289691
        f: 111.81058495821725
        f: 112.81337047353759
        f: 113.81615598885793
        f: 114.81894150417827
        f: 115.82172701949861
        f: 116.82451253481895
        f: 117.82729805013929
        f: 118.83008356545957
        f: 119.83286908077991
        f: 120.83565459610026
        f: 121.8384401114206
        f: 122.84122562674094
        f: 123.84401114206128
        f: 124.84679665738162
        f: 125.84958217270196
        f: 126.8523676880223
        f: 127.85515320334258
        f: 128.85793871866292
        f: 129.86072423398326
        f: 130.8635097493036
        f: 131.86629526462394
        f: 132.86908077994428
        f: 133.87186629526462
        f: 134.87465181058496
        f: 135.8774373259053
        f: 136.8802228412256
        f: 137.88300835654593
        f: 138.88579387186627
        f: 139.8885793871866
        f: 140.89136490250695
        f: 141.8941504178273
        f: 142.89693593314763
        f: 143.89972144846797
        f: 144.9025069637883
        f: 145.9052924791086
        f: 146.90807799442894
        f: 147.91086350974928
        f: 148.91364902506962
        f: 149.91643454038996
        f: 150.9192200557103
        f: 151.92200557103064
        f: 152.92479108635098
        f: 153.92757660167132
        f: 154.9303621169916
        f: 155.93314763231194
        f: 156.93593314763228
        f: 157.93871866295262
        f: 158.94150417827296
        f: 159.9442896935933
        f: 160.94707520891365
        f: 161.949860724234
        f: 162.95264623955433
        f: 163.9554317548746
        f: 164.95821727019495
        f: 165.9610027855153
        f: 166.96378830083563
        f: 167.96657381615597
        f: 168.9693593314763
        f: 169.97214484679665
        f: 170.974930362117
        f: 171.97771587743733
        f: 172.98050139275767
        f: 173.98328690807796
        f: 174.9860724233983
        f: 175.98885793871864
        f: 176.99164345403898
        f: 177.99442896935932
        f: 178.99721448467966
        f: 180.0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat_bucketized_X_Long_bucketized_embedding/Shape"
  op: "Shape"
  input: "dnn/input_from_feature_columns/input_layer/Lat_bucketized_X_Long_bucketized_embedding/Bucketize"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat_bucketized_X_Long_bucketized_embedding/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat_bucketized_X_Long_bucketized_embedding/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat_bucketized_X_Long_bucketized_embedding/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat_bucketized_X_Long_bucketized_embedding/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/Lat_bucketized_X_Long_bucketized_embedding/Shape"
  input: "dnn/input_from_feature_columns/input_layer/Lat_bucketized_X_Long_bucketized_embedding/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/Lat_bucketized_X_Long_bucketized_embedding/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/Lat_bucketized_X_Long_bucketized_embedding/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/Lat_bucketized_X_Long_bucketized_embedding/range/start"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
